{
  "common": {
    "close": "Close",
    "closeMenu": "Close menu",
    "openMenu": "Open menu"
  },
  "menu": {
    "home": "Home",
    "about": "About",
    "articles": "Articles",
    "career": "Career",
    "projects": "Projects"
  },
  "home": {
    "bio": "A software engineer with over 7 years of experience in web application development"
  },
  "about": {
    "title": "About",
    "bio": "<p>A software engineer with over 7 years of experience in web application development, with a strong background in <strong>problem-solving</strong>, <strong>adaptability</strong>, and driving solutions from <strong>start to finish</strong>.</p><p>Led and contributed to the development of applications for public and private companies across <strong>diverse sectors</strong>, using languages and tools such as TypeScript, Vue.js, Nuxt, PHP, Laravel, and Node.js. Takes <strong>ownership</strong> of solutions while <strong>collaborating effectively</strong> with teams, <strong>quickly adapting</strong> to new technologies and challenges.</p><p>Holds a <strong>BS in Computer Science</strong> and is pursuing a specialization certificate in <strong>Technical Leadership</strong>.</p>",
    "downloadResume": "Download Resume"
  },
  "career": {
    "title": "Career",
    "present": "Present",
    "seniorAtlas": {
      "title": "Senior Front-end Engineer",
      "description": "<ul><li>Work on performance and developer experience (DX) improvements as part of the platform team</li><li>Upgrade projects to Vue 3 and Nuxt 3</li><li>Migrate pages to a Nuxt 3 project</li><li>Achieve a 74% increase in the performance of a key page</li></ul>"
    },
    "consultantAtlas": {
      "title": "Front-end Engineering Consultant",
      "description": "<ul><li>Mentored and provided technical guidance to front-end engineers</li><li>Analyzed and developed project improvements</li><li>Contributed to the development of a component library using Lerna, TypeScript, and Vue.js</li><li>Contributed to the migration of key pages to a Nuxt project</li></ul>"
    },
    "frontAtlas": {
      "title": "Front-end Engineer",
      "description": "<ul><li>Contributed to the development of a security feature for a platform with over 20 million monthly visits</li><li>Deployed and monitored front-end tasks in production</li><li>Contributed with code reviews across multiple teams</li><li>Tracked and organized tasks in Jira using Scrum</li></ul>"
    },
    "ceoNuxstep": {
      "title": "CEO & Co-Founder",
      "description": "<ul><li>Planned, developed, and deployed web and mobile applications</li><li>Contributed to the execution of IT infrastructure projects</li><li>Developed a plugin that integrates Spotify's SDK into NativeScript using TypeScript</li></ul>"
    },
    "internGmaes": {
      "title": "Software Development Intern",
      "description": "<ul><li>Developed an inventory system for the City Hall of Francisco Beltrão using Vue.js and Laravel</li><li>Planned and developed the new website for the Federal Council of Engineering and Agronomy (CONFEA) using Drupal</li><li>Developed an integration between the Nuvemshop e-commerce platform and the SkyHub marketplace integrator using Nuxt and Node.js</li><li>Deployed and managed applications on Linux and Windows servers</li></ul>"
    }
  },
  "projects": {
    "title": "Projects",
    "featuredProjects": "Featured Projects",
    "allProjects": "All Projects",
    "andresilvacc": {
      "title": "andresilva.cc",
      "description": "The personal website that you are seeing right now"
    },
    "customBurger": {
      "title": "CustomBurger",
      "description": "A small project where you can build your own burger"
    },
    "injektion": {
      "title": "Injektion",
      "description": "Decorator-less dependency injection for JavaScript and TypeScript"
    },
    "renderingModesDemo": {
      "title": "Rendering Modes Demo",
      "description": "Demo of rendering modes in Nuxt 3"
    },
    "pocVueUniversalComponent": {
      "title": "poc-vue-universal-component",
      "description": "Proof of concept of universal components in Vue.js"
    },
    "expressApiTemplate": {
      "title": "Express API Template",
      "description": "An always evolving project template for creating APIs using Express, TypeScript, and Sequelize"
    },
    "reflectionFunction": {
      "title": "Reflection Function",
      "description": "Function reflection for JavaScript and TypeScript"
    },
    "crcmg": {
      "title": "CRCMG",
      "description": "Design for the new website of Minas Gerais state's Regional Accounting Council (CRCMG)"
    },
    "firebirdPermissions": {
      "title": "Firebird - Add permissions to multiple databases",
      "description": "A script that add permissions to multiple Firebird databases"
    },
    "nativescriptSpotify": {
      "title": "NativeScript Spotify",
      "description": "Integrate Spotify App Remote SDK into your NativeScript app"
    },
    "teseu": {
      "title": "Teseu",
      "description": "A collaborative application for notification of criminal occurrences in real-time"
    },
    "confea": {
      "title": "CONFEA",
      "description": "The new website of Brazil's Federal Council of Engineering and Agronomy (CONFEA)"
    },
    "oac": {
      "title": "OAC - Obstacle Avoiding Car",
      "description": "An application where you instruct an Artificial Neural Network to drive a car while avoiding obstacles"
    },
    "marketplaceBridge": {
      "title": "Marketplace Bridge",
      "description": "Integration between the Nuvemshop e-commerce platform and SkyHub marketplace integrator"
    },
    "voucherPrinter": {
      "title": "Voucher-Printer",
      "description": "Hotspot voucher printer via MikroTik RouterBoard API"
    }
  },
  "notFound": {
    "title": "404",
    "description": "Oops, this page doesn't exist."
  }
}